Tekla Open API Reference for Tekla Structures 2025
LineTypes Explicit Conversion (LineTypes to Int32)
 Returns the corresponding int value of the given LineTypes value.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static explicit operator int (
	LineTypes lineType
)
Public Shared Narrowing Operator CType (
	lineType As LineTypes
) As Integer
Parameters
lineType
Type: Tekla.Structures.Drawing.LineTypes
The given LineTypes value.
Return Value
Type: Int32
An int value corresponding to the given LineTypes value.
See Also
Reference
LineTypes Class
Explicit Overload
Tekla.Structures.Drawing Namespace